const initialState = [
  "Сенека",
  "Сенека",
  "Ж.Ренар",
  "Гёте",
  "Ш. Бодлер",
  "Н.А. Островский",
  "П.А.Павленко",
  "М.Горький",
  "Д. Лондон",
  "О.Уайльд",
  "Марк Аврелий",
  "О.Уайльд",
  "А.П.Чехов",
  "В.Гёте",
  "Сенека",
  "А.П. Чехов",
  "О.Бальзак",
  "Т.Ла Манc",
  "Ч.Чаплин",
  "Жан де Лабрюйер",
  "О.Уайльд",
  "Л. да Винчи",
  "С.Е.Лец",
  "В.Г.Белинский",
];

export default function authors (state = initialState, action) {
  if (action.type === 'ADD_AUTHOR') {
    return [
      ...state,
      action.payload
    ]
  }
  return state;
}
